app/controllers/school_classes_controller.rb

    def show
        @school_class = SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create

        @school_class = SchoolClass.new(school_classes_params)
        @school_class.title = params[:school_class][:title]
        @school_class.room_number = params[:school_class][:room_number]
        @school_class.save
---
INSERT INTO "school_classes" DEFAULT VALUES

    def edit
        @school_class = SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]